---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FamilyStructuralMaterialTypeFilter..::..PassesFilter Method
FamilyStructuralMaterialTypeFilter Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | PassesFilter(Element) | Applies the filter to a given element.  (Inherited from ElementFilter.) |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element.  (Inherited from ElementFilter.) |

# See Also

FamilyStructuralMaterialTypeFilter Class

FamilyStructuralMaterialTypeFilter Members

Autodesk.Revit.DB.Structure Namespace